// Напишите программу, которая на выход принимает число и выдает его квадрат (число умноженное на само себя).

Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine()); ;

Console.WriteLine(number * number);